[
  {
    "file": "experiments/flowoflife.js",
    "name": "Flow Of Life",
    "description": "This artwork depicts life’s flow — a single evolving line symbolizing persistence through change. Using Perlin noise for smooth, organic curves and a time variable for motion, it generates a meditative visual of resilience and subtle transformation."
  },
  {
    "file": "experiments/riversofbeing.js",
    "name": "Rivers of Being",
    "description": "This sketch expands on Flow of Life with layered lines shaped by Perlin noise, shifting colors, and subtle trails — creating an organic, ever-changing rhythm that reflects life’s continuous motion."
  },
  {
    "file": "experiments/starlitlife.js",
    "name": "Starlit Life",
    "description": "Flowing waves of noise dance beneath a twinkling starfield, creating a living, breathing night sky that feels full of motion and quiet energy."
  },
  {
    "file": "experiments/pulseoflife.js",
    "name": "Pulse of Life",
    "description": "This code draws a centered grid of squares with subtle random jitter. Every fourth square rotates 180°, adding dynamic irregularity. The grid shifts frame by frame, creating a lively, organic motion."
  },
  {
    "file": "experiments/pulseoflife2.js",
    "name": "Chaotic Cascade",
    "description": "Hundreds of squares tumble downward with random rotations, colors, and sizes, forming a shifting, abstract grid. Bright accents pop against a dark background, while squares seamlessly loop from top to bottom. The result is a hypnotic blend of structure and randomness in constant motion."
  },
  {
    "file": "experiments/symphonyofattraction.js",
    "name": "Symphony of Attraction",
    "description": "Captures the dance between motion and force. Pulsing ellipses and shifting hues reflect the balance of symmetry and randomness, evoking the rhythm and unpredictability of nature. The sketch becomes a visual meditation on attraction, movement, and the fleeting beauty of dynamic interactions."
  },
  {
    "file": "experiments/love.js",
    "name": "Love in Motion",
    "description": "A cloud of colorful particles dances across the screen, each drawn to the mouse like hearts pulled by invisible affection. Trails of glowing light trace their paths, creating a living web of vibrant love. The artwork turns interaction into a playful, flowing embrace of color and movement."
  },
  {
    "file": "experiments/new.js",
    "name": "Name",
    "description": "Description..."
  }
]
